#include <avr/io.h>      // โหลดนิยามสำหรับรีจีสเตอร์ที่ควบคุมอินพุท/เอาท์พุท
#include <util/delay.h>  // โหลดนิยามสำหรับฟังก์ชัน _delay_ms()
 
int main()
{
    DDRC  = 0b00000111;  // กำหนดให้ขา PC2,PC1,PC0 ทำหน้าที่เอาท์พุท
    while (1)
    {
        PORTC = 0b00000001;  // ทำให้ LED ทั้งสามดวงติดสว่าง
        _delay_ms(500);     // หน่วงเวลารอ 500 มิลลิวินาที
        PORTC = 0b00000010;  // ทำให้ LED ทั้งสามดวงดับ
        _delay_ms(500);     // หน่วงเวลารอ 500 มิลลิวินาที
        PORTC = 0b00000100;
        _delay_ms(500);
    }
}