# HW6_LIST (ไม่ลบห ม่ รือแรื ก้ไขบรร ก้ ทัดทั นี้ หรือเ รื พิ่มอะไร พิ่ ก่อนบรร ก่ ทัดทั นี้ โดยเด็ดขาด)
# - เขียนในเซล ขี ล์นี้ล์ เนี้ท่าท่ นั้นนั้
# - ถ้าถ้ต้องการเ ต้ ขียนขี ฟังก์ชัก์ นเ ชั พิ่มพิ่ ก็เก็ขียนในเซล ขี ล์นี้ล์ นี้
def compute_similarity(food_name1, food_name2):
# """
# รับ food_name1 และ food_name2 เป็นสตริงเริ ก็บก็ ชื่ออาหาร ชื่ ที่ตัที่ ดตั คำ มาให้แห้ล้วล้ โดยมีวรรค มี คั่นระห
# คั่
# ว่างว่ คำ
# คืนคื ค่าความค ค่ ล้ายของ ล้ ชื่ออาหาร ชื่ ซึ่งเซึ่ ป็นเลขจำ นวนจริงริที่มีที่ ค่มี าระห ค่ ว่างว่ [0,1]
# """
    pass
# ---------------------------------------------------
def match_foods(nutrient, food_name):
# """
# รับ nutrient เก็บตาราง ก็ ข้อข้มูลโภชนาการ มู รูปแบบของ รู ลิสลิต์ที่ต์ อที่ ธิบาย ธิ ข้างบน ข้
# รับ food_name เป็นสตริงริชื่ออาหาร ชื่ ที่ผู้ที่ บผู้ ริโภค ริ รับประทานที่ตัที่ ดตั คำ มาให้แห้ล้วล้ โดยมีวรรค มี คั่นระห
# คั่
# ว่างว่ คำ
# คืนคื ลิสลิต์ผลต์ ลัพลั ธ์ที่ธ์ เที่ ก็บร ก็ หัสอาหาร หั food_id ที่มีที่ ชื่มี ออาหารตรง ชื่ กับกั food_name มากที่สุที่ ดสุ รายละเอียดอี ดังอดั ธิบายไ ธิ ว้ข้ว้ างบน ข้
# """
# ---------------------------------------------------
def get_nutrient(nutrient,food_name):
# """
# รับ nutrient เก็บตาราง ก็ ข้อข้มูลโภชนาการ มู ในรูปแบบของ รู ลิสลิต์
# รับ food_name เป็นสตริงริชื่ออาหาร ชื่
# คืนคื ลิสลิต์ผลต์ ลัพลั ธ์ที่ธ์ เที่ ก็บก็ ข้อข้มูลพมู ลังงานและสารอาหาร ลั รายละเอียดอี ดังอดั ธิบายไ ธิ ว้ข้ว้ างบน ข้
# """
# ---------------------------------------------------
def summarize_daily_intake(nutrient, intakes):
# """
# รับ nutrient เก็บตาราง ก็ ข้อข้มูลโภชนาการ มู ในรูปแบบของ รู ลิสลิต์ที่ต์ อที่ ธิบาย ธิ ข้างข้ ต้นต้
# รับ intakes เก็บรายการการ ก็ รับประทานอาหารของผู้ใผู้ ช้ ในรูปแบบของ รู ลิสลิต์ที่ต์ อที่ ธิบาย ธิ ข้างข้ ต้นต้
# คืนคื ลิสลิต์ผลต์ ลัพลั ธ์ที่ธ์ เที่ ก็บก็ ข้อข้มูลสมู รุปโภชนาการสารอาหาร รุ ที่ไที่ ด้รัด้รับในแต่ละ ต่ วันวั รายละเอียดตาม อี ที่อที่ ธิบาย ธิ ข้างบน ข้
# """
# ---------------------------------------------------
def main():
nutrient = [['R010007', 'ลาบ หมู'มู , 267, 17, 23, 12, 2, 1470],
['R010014', 'ส้มส้ตำ ไทย', 143, 143, 31, 5, 27, 1064],
['R010005', 'ก๋วยเ ก๋ ตี๋ยวตี๋ ผัดไทย ใส่ ไข่'ข่ , 447, 49, 21, 18, 'NA', 1139],
['P010019', 'ขนมจีนจี ซาวน้ำ ', 437, 62, 9, 17, 'NA', 810],
[ , , , , , , , ],
['P010021', 'ขนมจีนจี น้ำ ยา', 348, 41, 14, 14, 11, 1210],
['P010023', 'ขนมจีนจี น้ำ พริกริ ', 497, 75, 11, 17, 'NA', 'NA'],
['P010041', 'ข้าวข้ หมก ไก่'ก่ , 481, 74, 19, 12, 'NA', 900],
['P020008', 'ข้าวข้ ราด กะเพรา ไก่'ก่ , 458, 60, 20, 15, 'NA', 1200],
['P010049', 'ข้าวข้ ไข่ พะโล้'ล้, 464, 55, 20, 18, 'NA', 946],
['P010025', 'ข้าวข้ ไก่ ผัด กะเพรา', 432, 54, 20, 15, 'NA', 'NA'],
['F010003', 'กล้วยล้ ไข่'ข่ , 62, 14, 0, 0, 7, 4],
['D010032', 'บัวลอย บั เผือกผื ', 336, 62, 2, 9, 'NA', 'NA'],
['D010033', 'ลำ ใย เผือกผื ', 'NA', 'NA', 'NA', 'NA', 'NA', 'NA']]
intakes = [['2022/01/15', 'ลาบ หมู'มู ],
['2022/01/15', 'ส้มส้ตำ ไทย'],
['2022/01/18', 'กาแฟ เย็น'],
['2022/01/14', 'แซนวิซวิ '],
['2022/01/19', 'ซาวน้ำ '],
['2022/01/15', 'ขนมจีนจี น้ำ ยา'],
['2022/01/16', 'ขนมจีนจี น้ำ พริกริ '],
['2022/01/16', 'ส้มส้ตำ ไทย'],
['2022/01/16', 'สลัดลั ทูน่ทู น่า'],
['2022/01/18', 'ข้าวข้ ไก่ ผัด กะเพรา'],
['2022/01/18', 'ส้มส้ตำ ไทย'],
['2022/01/18', 'แตงโม'],
['2022/01/14', 'ส้มส้ตำ ไทย'],
['2022/01/14', 'ลาบ หมู'มู ],
['2022/01/19', 'บัวลอย บั ']]
print(compute_similarity('ข้าวข้ กะเพรา ไก่'ก่ , 'ข้าวข้ ไก่ ผัด กะเพรา'))
print(match_foods(nutrient, 'ข้าวข้ กะเพรา ไก่'ก่ ))
print(get_nutrient(nutrient,'ห่อห่ หมก'))
print(summarize_daily_intake(nutrient, intakes))
main()
